joe6/pic18f4455/PIC18F4455ISelLowering.cpp
//
//                     The LLVM Compiler Infrastructure
//
// This file is distributed under the University of Illinois Open Source 
// License. See LICENSE.TXT for details.
//
//=----------------------------------------------------------------=//
//
// This file defines the interfaces that PIC18F4455 uses to lower
//    LLVM code into a selection DAG.
//
//=----------------------------------------------------------------=//

#define DEBUG_TYPE "pic18f4455-lower"
#include "PIC18F4455ABINames.h"
#include "PIC18F4455ISelLowering.h"
#include "PIC18F4455.h"
#include "PIC18F4455TargetMachine.h"
#include "PIC18F4455MachineFunctionInfo.h"
#include "llvm/DerivedTypes.h"
#include "llvm/GlobalValue.h"
#include "llvm/Function.h"
#include "llvm/CallingConv.h"
#include "llvm/CodeGen/CallingConvLower.h"
#include "llvm/CodeGen/MachineFrameInfo.h"
#include "llvm/CodeGen/MachineFunction.h"
#include "llvm/CodeGen/MachineInstrBuilder.h"
#include "llvm/CodeGen/MachineRegisterInfo.h"
#include "llvm/CodeGen/PseudoSourceValue.h"
#include "llvm/CodeGen/SelectionDAGISel.h"
#include "llvm/CodeGen/SelectionDAGNodes.h"
#include "llvm/CodeGen/TargetLoweringObjectFileImpl.h"
#include "llvm/CodeGen/ValueTypes.h"
#include "llvm/Support/CommandLine.h"
#include "llvm/Support/Debug.h"
#include "llvm/Support/ErrorHandling.h"
#include "llvm/Support/raw_ostream.h"
#include "llvm/ADT/StringExtras.h"
#include <iostream>


using namespace llvm;

// PIC18F4455TargetLowering Constructor.
PIC18F4455TargetLowering::
   PIC18F4455TargetLowering(PIC18F4455TargetMachine &TM) :
      TargetLowering(TM, new TargetLoweringObjectFileELF()) {
 
  Subtarget = &TM.getSubtarget<PIC18F4455Subtarget>();

  // Set up the register classes.
  addRegisterClass(MVT::i8, PIC18F4455::GR8RegisterClass);
  addRegisterClass(MVT::i16, PIC18F4455::GR16RegisterClass);

  // Compute derived properties from the register classes
  computeRegisterProperties();

  // Even if we have only 1 bit shift here, we can perform
  // shifts of the whole bitwidth 1 bit per step.
  setShiftAmountType(MVT::i8);

  setStackPointerRegisterToSaveRestore(PIC18F4455::SPWR);
  setBooleanContents(ZeroOrOneBooleanContent);

  // We have post-incremented loads / stores.
}

SDValue PIC18F4455TargetLowering::LowerOperation(SDValue Op,
                                            SelectionDAG &DAG) const {
  switch (Op.getOpcode()) {
    case ISD::ADD: // fall through
    case ISD::ADDC:
    case ISD::SUB:
    case ISD::SUBC:
    case ISD::STORE:       return ExpandStore(Op.getNode(), DAG);
    case ISD::MUL:         return LowerMUL(Op, DAG);
    case ISD::SHL:
    case ISD::SRA:
    case ISD::SRL:         return LowerShift(Op, DAG);
    case ISD::OR:
    case ISD::AND:
    default:
       DEBUG(Op.getOpcode());
       llvm_unreachable("unimplemented targetLowering operand in ");
       return SDValue();
  }
}

std::pair<const TargetRegisterClass*, uint8_t>
PIC18F4455TargetLowering::findRepresentativeClass(EVT VT) const {
  switch (VT.getSimpleVT().SimpleTy) {
  default:
    return TargetLowering::findRepresentativeClass(VT);
  case MVT::i16:
    return std::make_pair(PIC18F4455::GR16RegisterClass, 1);
  }
}

// getOutFlag - Extract the flag result if the Op has it.
static SDValue getOutFlag(SDValue &Op) {
  // Flag is the last value of the node.
  SDValue Flag = Op.getValue(Op.getNode()->getNumValues() - 1);

  assert (Flag.getValueType() == MVT::Flag 
          && "Node does not have an out Flag");

  return Flag;
}
// Get the TmpOffset for FrameIndex
unsigned PIC18F4455TargetLowering::GetTmpOffsetForFI(unsigned FI, unsigned size,
                                                MachineFunction &MF) const {
  PIC18F4455MachineFunctionInfo *FuncInfo = MF.getInfo<PIC18F4455MachineFunctionInfo>();
  std::map<unsigned, unsigned> &FiTmpOffsetMap = FuncInfo->getFiTmpOffsetMap();

  std::map<unsigned, unsigned>::iterator 
            MapIt = FiTmpOffsetMap.find(FI);
  if (MapIt != FiTmpOffsetMap.end())
      return MapIt->second;

  // This FI (FrameIndex) is not yet mapped, so map it
  FiTmpOffsetMap[FI] = FuncInfo->getTmpSize(); 
  FuncInfo->setTmpSize(FuncInfo->getTmpSize() + size);
  return FiTmpOffsetMap[FI];
}

void PIC18F4455TargetLowering::ResetTmpOffsetMap(SelectionDAG &DAG) const {
  MachineFunction &MF = DAG.getMachineFunction();
  PIC18F4455MachineFunctionInfo *FuncInfo = MF.getInfo<PIC18F4455MachineFunctionInfo>();
  FuncInfo->getFiTmpOffsetMap().clear();
  FuncInfo->setTmpSize(0);
}

// To extract chain value from the SDValue Nodes
// This function will help to maintain the chain extracting
// code at one place. In case of any change in future it will
// help maintain the code.
static SDValue getChain(SDValue &Op) { 
  SDValue Chain = Op.getValue(Op.getNode()->getNumValues() - 1);

  // If the last value returned in Flag then the chain is
  // second last value returned.
  if (Chain.getValueType() == MVT::Flag)
    Chain = Op.getValue(Op.getNode()->getNumValues() - 2);
  
  // All nodes may not produce a chain. Therefore following assert
  // verifies that the node is returning a chain only.
  assert (Chain.getValueType() == MVT::Other 
          && "Node does not have a chain");

  return Chain;
}

/// PopulateResults - Helper function to LowerOperation.
/// If a node wants to return multiple results after lowering,
/// it stuffs them into an array of SDValue called Results.

static void PopulateResults(SDValue N, SmallVectorImpl<SDValue>&Results) {
  if (N.getOpcode() == ISD::MERGE_VALUES) {
    int NumResults = N.getNumOperands();
    for( int i = 0; i < NumResults; i++)
      Results.push_back(N.getOperand(i));
  }
  else
    Results.push_back(N);
}

MVT::SimpleValueType
PIC18F4455TargetLowering::getSetCCResultType(EVT ValType) const {
  return MVT::i8;
}

MVT::SimpleValueType
PIC18F4455TargetLowering::getCmpLibcallReturnType() const {
  return MVT::i8; 
}

/// The type legalizer framework of generating legalizer can generate libcalls
/// only when the operand/result types are illegal.
/// PIC18F4455 needs to generate libcalls even for the legal types (i8) for some ops.
/// For example an arithmetic right shift. These functions are used to lower
/// such operations that generate libcall for legal types.

void 
PIC18F4455TargetLowering::setPIC18F4455LibcallName(PIC18F4455ISD::PIC18F4455Libcall Call,
                                         const char *Name) {
  PIC18F4455LibcallNames[Call] = Name; 
}

