joe6/pic18f4455/PIC18F4455ISelLowering.cpp
const char *
PIC18F4455TargetLowering::getPIC18F4455LibcallName(PIC18F4455ISD::PIC18F4455Libcall Call) const {
  return PIC18F4455LibcallNames[Call];
}

SDValue
PIC18F4455TargetLowering::MakePIC18F4455Libcall(PIC18F4455ISD::PIC18F4455Libcall Call,
                                      EVT RetVT, const SDValue *Ops,
                                      unsigned NumOps, bool isSigned,
                                      SelectionDAG &DAG, DebugLoc dl) const {

  TargetLowering::ArgListTy Args;
  Args.reserve(NumOps);

  TargetLowering::ArgListEntry Entry;
  for (unsigned i = 0; i != NumOps; ++i) {
    Entry.Node = Ops[i];
    Entry.Ty = Entry.Node.getValueType().getTypeForEVT(*DAG.getContext());
    Entry.isSExt = isSigned;
    Entry.isZExt = !isSigned;
    Args.push_back(Entry);
  }

  SDValue Callee = DAG.getExternalSymbol(getPIC18F4455LibcallName(Call), MVT::i16);

   const Type *RetTy = RetVT.getTypeForEVT(*DAG.getContext());
   std::pair<SDValue,SDValue> CallInfo = 
     LowerCallTo(DAG.getEntryNode(), RetTy, isSigned, !isSigned, false,
                 false, 0, CallingConv::C, false,
                 /*isReturnValueUsed=*/true,
                 Callee, Args, DAG, dl);

  return CallInfo.first;
}

const char *PIC18F4455TargetLowering::getTargetNodeName(unsigned Opcode) const {
  switch (Opcode) {
  default:                         return NULL;
  case PIC18F4455ISD::Lo:               return "PIC18F4455ISD::Lo";
  case PIC18F4455ISD::Hi:               return "PIC18F4455ISD::Hi";
  case PIC18F4455ISD::MTLO:             return "PIC18F4455ISD::MTLO";
  case PIC18F4455ISD::MTHI:             return "PIC18F4455ISD::MTHI";
  case PIC18F4455ISD::MTPCLATH:         return "PIC18F4455ISD::MTPCLATH";
  case PIC18F4455ISD::PIC18F4455Connect:     return "PIC18F4455ISD::PIC18F4455Connect";
  case PIC18F4455ISD::PIC18F4455Load:        return "PIC18F4455ISD::PIC18F4455Load";
  case PIC18F4455ISD::PIC18F4455LdArg:       return "PIC18F4455ISD::PIC18F4455LdArg";
  case PIC18F4455ISD::PIC18F4455LdWF:        return "PIC18F4455ISD::PIC18F4455LdWF";
  case PIC18F4455ISD::PIC18F4455Store:       return "PIC18F4455ISD::PIC18F4455Store";
  case PIC18F4455ISD::PIC18F4455StWF:        return "PIC18F4455ISD::PIC18F4455StWF";
  case PIC18F4455ISD::BCF:              return "PIC18F4455ISD::BCF";
  case PIC18F4455ISD::LSLF:             return "PIC18F4455ISD::LSLF";
  case PIC18F4455ISD::LRLF:             return "PIC18F4455ISD::LRLF";
  case PIC18F4455ISD::RLF:              return "PIC18F4455ISD::RLF";
  case PIC18F4455ISD::RRF:              return "PIC18F4455ISD::RRF";
  case PIC18F4455ISD::CALL:             return "PIC18F4455ISD::CALL";
  case PIC18F4455ISD::CALLW:            return "PIC18F4455ISD::CALLW";
  case PIC18F4455ISD::SUBCC:            return "PIC18F4455ISD::SUBCC";
  case PIC18F4455ISD::SELECT_ICC:       return "PIC18F4455ISD::SELECT_ICC";
  case PIC18F4455ISD::BRCOND:           return "PIC18F4455ISD::BRCOND";
  case PIC18F4455ISD::RET:              return "PIC18F4455ISD::RET";
  case PIC18F4455ISD::RETLW:            return "PIC18F4455ISD::RETLW";
  case PIC18F4455ISD::Dummy:            return "PIC18F4455ISD::Dummy";
  }
}

void PIC18F4455TargetLowering::ReplaceNodeResults(SDNode *N,
                                             SmallVectorImpl<SDValue>&Results,
                                             SelectionDAG &DAG) const {

  switch (N->getOpcode()) {
    case ISD::GlobalAddress:
      Results.push_back(ExpandGlobalAddress(N, DAG));
      return;
    case ISD::ExternalSymbol:
      Results.push_back(ExpandExternalSymbol(N, DAG));
      return;
    case ISD::STORE:
      Results.push_back(ExpandStore(N, DAG));
      return;
    case ISD::LOAD:
      //assert (0 && "Load not implemented");
      //PopulateResults(ExpandLoad(N, DAG), Results);
      return;
    case ISD::ADD:
      //assert (0 && "add not implemented");
      // Results.push_back(ExpandAdd(N, DAG));
      return;
    case ISD::FrameIndex:
      //assert (0 && "frameindex not implemented");
      //Results.push_back(ExpandFrameIndex(N, DAG));
      return;
    default:
      std::cout << ("not implemented " + utostr(N->getOpcode())) << std::endl;
      assert (0 && "not implemented ");
      return;
  }
}

#include "PIC18F4455GenCallingConv.inc"

SDValue
PIC18F4455TargetLowering::
   LowerFormalArguments(SDValue Chain
                       , CallingConv::ID CallConv
                       , bool isVarArg
                       , const SmallVectorImpl<ISD::InputArg> &Ins
                       , DebugLoc dl
                       , SelectionDAG &DAG
                       , SmallVectorImpl<SDValue> &InVals) const {
  switch (CallConv) {
  default:
    llvm_unreachable("Unsupported calling convention");
  case CallingConv::Fast:
  case CallingConv::C:
    return LowerCCCArguments(Chain, CallConv, isVarArg, Ins
                            , dl, DAG, InVals);
  }
}

/// LowerCCCArguments - transform physical registers into virtual registers and
/// generate load operations for arguments places on the stack.
// FIXME: struct return stuff
// FIXME: varargs
SDValue PIC18F4455TargetLowering::
   LowerCCCArguments(SDValue Chain
                    , CallingConv::ID CallConv
                    , bool isVarArg
                    , const SmallVectorImpl<ISD::InputArg> &Ins
                    , DebugLoc dl
                    , SelectionDAG &DAG
                    , SmallVectorImpl<SDValue> &InVals) const {
  MachineFunction &MF = DAG.getMachineFunction();
  MachineFrameInfo *MFI = MF.getFrameInfo();
  MachineRegisterInfo &RegInfo = MF.getRegInfo();

  // Assign locations to all of the incoming arguments.
  SmallVector<CCValAssign, 16> ArgLocs;
  CCState CCInfo(CallConv, isVarArg, getTargetMachine(),
                 ArgLocs, *DAG.getContext());
  CCInfo.AnalyzeFormalArguments(Ins, CC_PIC18F4455);

  assert(!isVarArg && "Varargs not supported yet");

  for (unsigned i = 0, e = ArgLocs.size(); i != e; ++i) {
    CCValAssign &VA = ArgLocs[i];
    if (VA.isRegLoc()) {
      // Arguments passed in registers
      EVT RegVT = VA.getLocVT();
      unsigned VReg;
      switch (RegVT.getSimpleVT().SimpleTy) {
      default: {
         DEBUG(errs() << "LowerFormalArguments Unhandled argument type: "
                      << RegVT.getSimpleVT().SimpleTy << "\n");
         llvm_unreachable(0);
        }
      case MVT::i8:
         VReg =
          RegInfo.createVirtualRegister(PIC18F4455::GR8RegisterClass);
      //case MVT::i16:
      //   VReg =
      //    RegInfo.createVirtualRegister(PIC18F4455::FSR16RegisterClass);
      }
      RegInfo.addLiveIn(VA.getLocReg(), VReg);
      SDValue ArgValue = DAG.getCopyFromReg(Chain, dl, VReg, RegVT);
      InVals.push_back(ArgValue);
    } else {
      // Sanity check
      assert(VA.isMemLoc());
      // Load the argument to a virtual register
      unsigned ObjSize = VA.getLocVT().getSizeInBits()/8;
      if (ObjSize > 2) {
        errs() << "LowerFormalArguments Unhandled argument type: "
             << VA.getLocVT().getSimpleVT().SimpleTy
             << "\n";
      }
      // Create the frame index object for this incoming parameter...
      int FI =
            MFI->CreateFixedObject(ObjSize, VA.getLocMemOffset(), true);

      // Create the SelectionDAG nodes corresponding to a load
      //    from this parameter
      SDValue FIN = DAG.getFrameIndex(FI, MVT::i16);
      InVals.push_back(DAG.getLoad(VA.getLocVT(), dl, Chain, FIN
                                  , PseudoSourceValue::getFixedStack(FI)
                                  , 0, false, false, 0));
    }
  }

