joe6/pic18f4455/PIC18F4455ISelLowering.cpp
  if ((Outs.size() == 1) && (Outs[0].VT == MVT::i8)
      && (isa<ConstantSDNode>(OutVals[0].getNode()))){
   DEBUG(errs() << "siva: Outs.size == 1 "
                << "and Outs[0].VT  == MVT::i8"
                << "is constantnode = "
                << (isa<ConstantSDNode>(OutVals[0].getNode())) << "\n");
   return DAG.getNode(PIC18F4455ISD::RETLW, dl, MVT::Other, Chain
                     , OutVals[0]);
  }

  SDValue Flag;
  // Copy the result values into the output registers.
  for (unsigned i = 0; i != RVLocs.size(); ++i) {
    CCValAssign &VA = RVLocs[i];
    assert(VA.isRegLoc() && "Can only return in registers!");

    Chain = DAG.getCopyToReg(Chain, dl, VA.getLocReg(),
                             OutVals[i], Flag);

    // Guarantee that all emitted copies are stuck together,
    // avoiding something bad.
    Flag = Chain.getValue(1);
  }

  if (Flag.getNode())
    return DAG.getNode(PIC18F4455ISD::RET, dl, MVT::Other, Chain
                      , Flag);

  // Return Void
  return DAG.getNode(PIC18F4455ISD::RET, dl, MVT::Other, Chain);
}

void PIC18F4455TargetLowering::
GetDataAddress(DebugLoc dl, SDValue Callee, SDValue &Chain, 
               SDValue &DataAddr_Lo, SDValue &DataAddr_Hi,
               SelectionDAG &DAG) const {
   assert (Callee.getOpcode() == PIC18F4455ISD::PIC18F4455Connect
           && "Don't know what to do of such callee!!");
   SDValue ZeroOperand = DAG.getConstant(0, MVT::i8);
   SDValue SeqStart  = DAG.getCALLSEQ_START(Chain, ZeroOperand);
   Chain = getChain(SeqStart);
   SDValue OperFlag = getOutFlag(SeqStart); // To manage the data dependency

   // Get the Lo and Hi part of code address
   SDValue Lo = Callee.getOperand(0);
   SDValue Hi = Callee.getOperand(1);

   SDValue Data_Lo, Data_Hi;
   SDVTList Tys = DAG.getVTList(MVT::i8, MVT::Other, MVT::Flag);
   // Subtract 2 from Address to get the Lower part of DataAddress.
   SDVTList VTList = DAG.getVTList(MVT::i8, MVT::Flag);
   Data_Lo = DAG.getNode(ISD::SUBC, dl, VTList, Lo, 
                         DAG.getConstant(2, MVT::i8));
   SDValue Ops[3] = { Hi, DAG.getConstant(0, MVT::i8), Data_Lo.getValue(1)};
   Data_Hi = DAG.getNode(ISD::SUBE, dl, VTList, Ops, 3);
   SDValue PCLATH = DAG.getNode(PIC18F4455ISD::MTPCLATH, dl, MVT::i8, Data_Hi);
   Callee = DAG.getNode(PIC18F4455ISD::PIC18F4455Connect, dl, MVT::i8, Data_Lo, PCLATH);
   SDValue Call = DAG.getNode(PIC18F4455ISD::CALLW, dl, Tys, Chain, Callee,
                              OperFlag);
   Chain = getChain(Call);
   OperFlag = getOutFlag(Call);
   SDValue SeqEnd = DAG.getCALLSEQ_END(Chain, ZeroOperand, ZeroOperand,
                                       OperFlag);
   Chain = getChain(SeqEnd);
   OperFlag = getOutFlag(SeqEnd);

   // Low part of Data Address 
   DataAddr_Lo = DAG.getNode(PIC18F4455ISD::MTLO, dl, MVT::i8, Call, OperFlag);

   // Make the second call.
   SeqStart  = DAG.getCALLSEQ_START(Chain, ZeroOperand);
   Chain = getChain(SeqStart);
   OperFlag = getOutFlag(SeqStart); // To manage the data dependency

   // Subtract 1 from Address to get high part of data address.
   Data_Lo = DAG.getNode(ISD::SUBC, dl, VTList, Lo, 
                         DAG.getConstant(1, MVT::i8));
   SDValue HiOps[3] = { Hi, DAG.getConstant(0, MVT::i8), Data_Lo.getValue(1)};
   Data_Hi = DAG.getNode(ISD::SUBE, dl, VTList, HiOps, 3);
   PCLATH = DAG.getNode(PIC18F4455ISD::MTPCLATH, dl, MVT::i8, Data_Hi);

   // Use new Lo to make another CALLW
   Callee = DAG.getNode(PIC18F4455ISD::PIC18F4455Connect, dl, MVT::i8, Data_Lo, PCLATH);
   Call = DAG.getNode(PIC18F4455ISD::CALLW, dl, Tys, Chain, Callee, OperFlag);
   Chain = getChain(Call);
   OperFlag = getOutFlag(Call);
   SeqEnd = DAG.getCALLSEQ_END(Chain, ZeroOperand, ZeroOperand,
                                        OperFlag);
   Chain = getChain(SeqEnd);
   OperFlag = getOutFlag(SeqEnd);
   // Hi part of Data Address
   DataAddr_Hi = DAG.getNode(PIC18F4455ISD::MTHI, dl, MVT::i8, Call, OperFlag);
}

bool PIC18F4455TargetLowering::isDirectLoad(const SDValue Op) const {
  if (Op.getOpcode() == PIC18F4455ISD::PIC18F4455Load)
    if (Op.getOperand(1).getOpcode() == ISD::TargetGlobalAddress
     || Op.getOperand(1).getOpcode() == ISD::TargetExternalSymbol)
      return true;
  return false;
}

// NeedToConvertToMemOp - Returns true if one of the operands of the
// operation 'Op' needs to be put into memory. Also returns the
// operand no. of the operand to be converted in 'MemOp'. Remember, PIC18F4455 has 
// no instruction that can operation on two registers. Most insns take
// one register and one memory operand (addwf) / Constant (addlw).
bool PIC18F4455TargetLowering::NeedToConvertToMemOp(SDValue Op, unsigned &MemOp, 
                      SelectionDAG &DAG) const {
  // If one of the operand is a constant, return false.
  if (Op.getOperand(0).getOpcode() == ISD::Constant ||
      Op.getOperand(1).getOpcode() == ISD::Constant)
    return false;    

  // Return false if one of the operands is already a direct
  // load and that operand has only one use.
  if (isDirectLoad(Op.getOperand(0))) {
    if (Op.getOperand(0).hasOneUse()) {  
      // Legal and profitable folding check uses the NodeId of DAG nodes.
      // This NodeId is assigned by topological order. Therefore first 
      // assign topological order then perform legal and profitable check.
      // Note:- Though this ordering is done before begining with legalization,
      // newly added node during legalization process have NodeId=-1 (NewNode)
      // therefore before performing any check proper ordering of the node is
      // required.
      DAG.AssignTopologicalOrder();

      // Direct load operands are folded in binary operations. But before folding
      // verify if this folding is legal. Fold only if it is legal otherwise
      // convert this direct load to a separate memory operation.
      if (SelectionDAGISel::IsLegalToFold(Op.getOperand(0),
                                          Op.getNode(), Op.getNode(),
                                          CodeGenOpt::Default))
        return false;
      else 
        MemOp = 0;
    }
  }

  // For operations that are non-cummutative there is no need to check 
  // for right operand because folding right operand may result in 
  // incorrect operation. 
  if (! SelectionDAG::isCommutativeBinOp(Op.getOpcode()))
    return true;

  if (isDirectLoad(Op.getOperand(1))) {
    if (Op.getOperand(1).hasOneUse()) {
      // Legal and profitable folding check uses the NodeId of DAG nodes.
      // This NodeId is assigned by topological order. Therefore first 
      // assign topological order then perform legal and profitable check.
      // Note:- Though this ordering is done before begining with legalization,
      // newly added node during legalization process have NodeId=-1 (NewNode)
      // therefore before performing any check proper ordering of the node is
      // required.
      DAG.AssignTopologicalOrder();

      // Direct load operands are folded in binary operations. But before folding
      // verify if this folding is legal. Fold only if it is legal otherwise
      // convert this direct load to a separate memory operation.
      if (SelectionDAGISel::IsLegalToFold(Op.getOperand(1),
                                          Op.getNode(), Op.getNode(),
                                          CodeGenOpt::Default))
         return false;
      else 
         MemOp = 1; 
    }
  }
  return true;
}  

